Autodesk.Revit.DB.ViewDiscipline
Discipline of the view
Since:
2013

Autodesk.Revit.DB.ViewDiscipline.Coordination
Coordination

Autodesk.Revit.DB.ViewDiscipline.Plumbing
Plumbing

Autodesk.Revit.DB.ViewDiscipline.Electrical
Electrical

Autodesk.Revit.DB.ViewDiscipline.Mechanical
Mechanical

Autodesk.Revit.DB.ViewDiscipline.Structural
Structural

Autodesk.Revit.DB.ViewDiscipline.Architectural
Architectural